OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/multiphase/multiphaseEulerFoam/RAS/Grossetete/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
runApplication extrudeMesh
runApplication $application
( cd validation && ./createGraphs )

#------------------------------------------------------------------------------
